#1. მომხარებელმა შემოიყვანოს ასაკი და დაუბეჭდეთ რამდენ წელში გახდება ის 50 წლის. თუ არასწორ ტიპს შემოიყვანს დაბეჭდეთ შესაბამისი ტექსტი. გაითვალისწინეთ რომ მომხარებელმა შეიძლება შმეოიყვანოს უარყოფითი რიცხვი ან 50 წელზე მეტი ან თუნდაც სტრინგი.

#2. დაწერეთ პროგრამა რომლის მეშვებით შეიტანთ ნებისმიერ სტრიქონს (input ბრძანების
#გამოყენებით). დაბეჭდეთ შეყვანილი სტრიქონის სიგრძე (სიმბოლოების რაოდენობა).

#3. შეიყვანეთ სტრიქონი. დაითვალეთ რამდენჯერ შეგხვდათ სიმბოლო “a” დაბეჭდეთ შედეგი.

#Bonus point:
#შეიყვანეთ ნებისმიერი სტრიქონი. დაადგინეთ არის თუ არა შეტანილი სტრიქონი პალინდრომი. (მითითება:
#პალინდრომია სტრიქონი, რომელიც მარჯვნიდან და მარცხნიდან ერთნაირად იკითხება). მაგ. გალაკტიონის ერთ-
#ერთი ლექსის ყველა ტაეპი წარმოადგენს პალინდრომს:

#აი რა მზის სიზმარია
#აირევი ივერია
#აი დროშა აშორდია
#აერების სიბერეა


#1
age = input("input your age: ")
left = 0
if age.isdigit():
    age = int(age)
    left = 50 - age
    print(left)
else:
    print("you input isn't a number")
    
#2
text = input("input text: ")
print(len(text))

#3
text1 = (input("input you text: "))
index = 0
amount = 0
for index in range(0,len(text1)):
    letter_a = text1[index]
    if letter_a == 'a':
        amount += 1
print(amount)

#Bonus:
#???