#1. შექმენით ლექსიკონი(dict): {0: 10, 1: 20}. დაამატეთ 2 ახალი ელემენტი და დადაბეჭდეთ მიღებული ლექსიკონი.(გამოიყენეთ update მეთოდიც). ასევე წაშალეთ რომელიმე ელემენტი.
#2. დაწერეთ პროგრამა რომელიც შეამოწმებს რომელიმე key(გასაღები) არის თუარა (dict)ლექსიკონში -> d = {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}
#დადაბეჭდეთ შესაბამისი შეტობინება.(მითითება: გამოიყენეთ in ოპერატორი).
#3. მოცემულია ლექსიკონი(dict) d = {'x': 10, 'y': 20, 'z': 30} დაბეჭდეთ თითოეული ელემენტის key და value შემდეგნაირად
#(მითითება: გამოიყენეთ for ციკლი): x-> 10 y-> 20 z-> 30


#1
dict = {0:10, 1:20}
dict2 = {2:30, 3:40}
dict.update(dict2)
print(dict)

#2
#???

#3
d = {'x': 10, 'y': 20, 'z': 30}
for key, value in d.items():