#1. შექმენით სია numbs ნებისმიერ 5 რიცხვითი მნიშვნელობით. იპოვეთ ამ
#რიცხვების ჯამი, მინიმალური, მაქსიმალური და საშუალო არითმეტიკული.
#ასევე შეასრულეთ შემდეგი ოპერაციები:
#• სიას დაამატეთ ბოლო ელემენტად რიცხვი 102
#• სიის მესამე ელემენტად ჩასვით რიცხვი 205
#• წაშალეთ სიის მე-4 ელემენტი
#• დაალაგეთ სია ზრდადობის მიხედვით და დაბეჭდეთ

#2. დაწერეთ პროგრამა, რომლის მეშვეობით შეიყვანთ (input-ით) 10 მონაცემს.
#წარმოადგინეთ და დაბეჭდეთ ისინი სიის ელემენტების სახის. ანუ ლუპის მეშვეობით დაპრინტეთ ყველა ელემენტი

#3. დაწერეთ პროგრამა, რომელიც რიცხვითი მნიშვნელობების სიაში ამოშლის კენტ
#რიცხვებს. დაბეჭდეთ მიღებული სია.




#1
numbs = [5, 8, 16, 3, 9]
sum = 0
avarage = 0
for i in numbs:
    sum += i
print (sum)
print(max(numbs))
print(min(numbs))
avarage = sum / 5
print (avarage)
numbs.append(102)
print(numbs)
numbs.insert(2, 205)
print(numbs)
numbs.pop(3)
print(numbs)
for _ in range(len(numbs)):
    if numbs[1] < numbs[0]:
        numbs.append(numbs[0])
        numbs.pop(0) 
print(numbs)
#2
#???


#3
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
for i in range(len(numbers)):
    if numbers[i] % 2 == 1:
        numbers.pop(i)
print(numbers)